//.title
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//
// 🇽🇾🇿 & Dev
//
// Licencing details are in the LICENSE file in the root directory.
//
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//.title~

enum DistanceUnit {
  //
  //
  //

  METRES(1.0),
  KILOMETRES(1.0 / 1000.0),
  MILES(1.0 / 1609.34),
  NAUTICAL_MILES(1.0 / 1852.0),
  FEET(3.28084),
  YARDS(1.09361),
  ASTRONOMICAL_UNITS(1.0 / 149597870700);

  //
  //
  //

  final double conversion;

  //
  //
  //

  const DistanceUnit(this.conversion);
}
